# Control flow არის პროგრამირების ელემენტი, რომელიც განსაზღვრავს პროგრამის კოდის შესრულების მიმდევრობას. იგი საშუალებას აძლევს პროგრამას, განსაზღვროს, როგორ და რა პირობებით უნდა შესრულდეს კონკრეტული კოდი, რათა პროგრამამ მოახდინოს საჭირო გადაწყვეტილებების მიღება და მუშაობა სხვადასხვა სიტუაციაში.

# if condition:
#     # კოდი, რომელიც შესრულდება, თუ condition ჭეშმარიტია
# elif another_condition:
#     # კოდი, რომელიც შესრულდება, თუ another_condition ჭეშმარიტია
# else:
#     # კოდი, რომელიც შესრულდება, თუ არც ერთი პირობა არ დაკმაყოფილდა