# ფორმატის ფუნქცია და f პატარა ტექსტის განსხვავება:

# format() ფუნქცია გამოიყენება სტრინგების ფორმატირებისთვის. ის საშუალებას გაძლევთ გამოიყენოთ სხვადასხვა ფერამდები str.format() მეთოდზე, მაგალითად:

python
name = "თაზო"
age = 30
text = "My name is {} and I am {} years old.".format(name, age)


# აქ, {} ნიშნები იქნება ჩანაცვლებული name და age ცვლადების მნიშვნელობებით.

# F პატარა ტექსტი (f-strings) არის Python 3.6 შემოღებული უფრო მარტივი მეთოდი სტრინგის ფორმატირებისათვის. f-strings უკეთ პრეფორმენსი და კოდი ნაკლებად კითხვისარიუმია:

# python
name = "თაზო"
age = 30
text = f"My name is {name} and I am {age} years old."
# აქ, მხოლოდ {} ნიშნები ჩანაცვლებიან ცვლადიების მნიშვნელობებით ინლაინში.




# append() და insert()-ს მოქნცლი განსხვავებები:

# append() მეთოდი გამოიყენება სიის ბოლოს ახალი ელემენტის დასამატებლად, მაგალითად:

# python
my_list = [1, 2, 3]
my_list.append(4)  # Result: [1, 2, 3, 4]

# insert() მეთოდი საშუალებას იძლევა დაამატოთ ელემენტი სიაში ნებისმიერ ლოკაციაში კონკრეტული ინდექსით:

# python
my_list = [1, 2, 3]
my_list.insert(1, "a")  # Result: [1, "a", 2, 3]
